

{"projectName":"Cardboard Birdhouse","description":"Create a simple birdhouse using cardboard to provide shelter for small birds in your garden or backyard.","materials":[{"name":"Corrugated cardboard","quantity":"1 large sheet"},{"name":"Scissors","quantity":"N/A"},{"name":"Glue stick","quantity":"1"},{"name":"Paints and brushes","quantity":"Set of basic colors"},{"name":"Pencil","quantity":"1"}],"steps":[{"title":"Cut the Cardboard","action":"Measure and cut out pieces for the birdhouse.","details":"Cut a rectangular piece (base), two smaller rectangles (sides), one rectangle slightly larger than the base (roof), and four small squares (entrance holes).","purpose":"To form the basic structure of the birdhouse.","tools":["Scissors"],"warnings":["Be careful when using scissors, especially if working with young children."]},{"title":"Assemble the Birdhouse","action":"Glue the pieces together to form a box shape.","details":"Apply glue along the edges of the sides and attach them to the base. Fold and secure the roof piece over the top, gluing it in place.","purpose":"To create the main body of the birdhouse.","tools":["Glue stick"],"warnings":[]},{"title":"Create Entrance Holes","action":"Cut small circular holes on the sides of the birdhouse.","details":"Use a hole punch or a round object to make several entrance holes, ensuring they are not too large for predators but still accessible for birds.","purpose":"To provide entry points for birds.","tools":["Hole punch"],"warnings":[]},{"title":"Add Finishing Touches","action":"Paint the birdhouse and add any decorative elements.","details":"Apply a coat of paint to the exterior, allowing it to dry completely. You can also add small decorations or patterns using additional paints.","purpose":"To make the birdhouse visually appealing and weather-resistant.","tools":["Paints and brushes"],"warnings":[]},{"title":"Attach a Hanger","action":"Cut a piece of string and attach it to the top of the roof for hanging.","details":"Fold a small loop in one end of the string, thread it through a hole cut at the top center of the roof, then tie a knot to secure it tightly.","purpose":"To allow easy placement of the birdhouse in your garden or backyard.","tools":["Scissors"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"DIY Chalkboard Wall Art","description":"Transform scrap pallet wood into unique wall art using chalkboard paint. This project is perfect for adding a rustic touch to your home or office.","materials":[{"name":"Scrap pallet wood","quantity":"1-2 pieces"},{"name":"Nails","quantity":"Approx. 50"},{"name":"Chalkboard paint","quantity":"1 can"}],"steps":[{"title":"Prepare the Pallet Wood","action":"Clean and sand the pallet wood to remove any splinters or rough edges.","details":"Use a fine-grit sandpaper to smooth out the surface of the wood. Wipe away any dust with a damp cloth.","purpose":"Ensure the wood is clean and ready for painting.","tools":["Fine-grit sandpaper","Damp cloth"],"warnings":["Wear gloves when handling nails."]},{"title":"Attach Nails","action":"Hammer nails into the back of the pallet wood to create a hanging mechanism.","details":"Space the nails evenly along the top edge of the wood. Hammer them in until they are flush with the surface.","purpose":"Provide a secure way to hang your chalkboard art.","tools":["Hammer"],"warnings":[]},{"title":"Paint the Pallet Wood","action":"Apply chalkboard paint to one side of the pallet wood using a brush or roller.","details":"Follow the instructions on the paint can for best results. Apply at least two coats, allowing each coat to dry completely before applying the next.","purpose":"Transform the wood into a functional chalkboard surface.","tools":["Brush or roller","Paint tray"],"warnings":[]},{"title":"Allow Drying Time","action":"Let the painted side of the pallet wood dry completely before handling it.","details":"Follow the drying time recommended on the chalkboard paint can. This may take several hours or overnight.","purpose":"Ensure the paint is fully cured and safe to use.","tools":[],"warnings":[]},{"title":"Hang Your Chalkboard Art","action":"Attach a string or wire to the nails on the back of the pallet wood, then hang it on your wall.","details":"Use a nail or hook that can support the weight of the pallet wood. Adjust the position as needed for aesthetic purposes.","purpose":"Display your new chalkboard art in your home or office.","tools":["String or wire","Nail or hook"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"Cardboard Birdhouse","description":"Create a simple birdhouse using cardboard and basic crafting tools. This project is perfect for beginners and can be customized with paint or markers.","materials":[{"name":"Corrugated Cardboard","quantity":"1 sheet"},{"name":"Scissors","quantity":"N/A"},{"name":"Craft Knife","quantity":"N/A"},{"name":"Ruler","quantity":"N/A"},{"name":"Pencil","quantity":"N/A"},{"name":"Paints or Markers (optional)","quantity":"N/A"}],"steps":[{"title":"Measure and Cut","action":"Using a ruler, measure and mark the dimensions for the birdhouse. Typically, you'll need four sides, a bottom, and an entrance hole.","details":"Cut out the pieces using scissors or a craft knife.","purpose":"To create the basic shape of the birdhouse.","tools":["Scissors","Craft Knife"],"warnings":["Be careful when using sharp tools."]},{"title":"Assemble","action":"Fold and glue the sides together to form a box. Attach the bottom piece with glue or tape.","details":"Ensure all corners are glued securely for stability.","purpose":"To assemble the birdhouse into its final shape.","tools":["Glue Stick","Tape"],"warnings":[]},{"title":"Add Entrance Hole","action":"Cut a small circular hole in one of the sides where you want the entrance to be.","details":"This will serve as the birdhouse's entrance. Make sure it’s not too big for the birds you intend to attract.","purpose":"To provide an entry point for birds.","tools":["Craft Knife"],"warnings":[]},{"title":"Paint or Decorate (Optional)","action":"Use paints or markers to decorate your birdhouse. This step is optional but can make the project more fun and personalized.","details":"Let the paint dry completely before placing it outside.","purpose":"To add a personal touch and protect the cardboard from weathering.","tools":["Paints","Markers"],"warnings":[]},{"title":"Place Outside","action":"Attach a string or hook to the top of the birdhouse for hanging. Place it in a suitable location outside where birds can easily find and use it.","details":"Choose an area that is safe from predators but still accessible to birds.","purpose":"To provide shelter for local wildlife.","tools":["String","Hook"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"DIY Hanging Lantern","description":"Create a unique and eco-friendly hanging lantern using plastic bottles, rope, and LED strip lights.","materials":[{"name":"Plastic bottles","quantity":"4-6"},{"name":"Rope","quantity":"10 meters"},{"name":"LED strip lights","quantity":"2 meters"}],"steps":[{"title":"Prepare the Bottles","action":"Clean and dry the plastic bottles thoroughly.","details":"Remove any labels or stickers from the bottles. Ensure they are completely clean to avoid any residue affecting the glue or paint.","purpose":"To ensure a clean surface for the next steps.","tools":[],"warnings":["Handle with care as the bottles may be fragile."]},{"title":"Cut the Bottles","action":"Cut the plastic bottles in half using a sharp knife or box cutter.","details":"Make sure to cut at the widest part of the bottle, just below the shoulder. This will create two halves that can be used as lanterns.","purpose":"To shape the bottles into usable lantern parts.","tools":["Sharp knife or box cutter"],"warnings":["Be careful when using sharp tools."]},{"title":"Attach LED Strip Lights","action":"Insert one end of the LED strip lights into the bottom half of a bottle.","details":"Use hot glue to secure the LED strip in place. Apply a small amount of glue around the edges where the LED strip will be inserted, and press it firmly into position.","purpose":"To light up the lantern from within.","tools":["Hot glue gun"],"warnings":["Be cautious with heat when using hot glue."]},{"title":"Secure the Bottles","action":"Wrap the rope around the top half of each bottle and tie it tightly to form a handle.","details":"Cut two pieces of rope, about 1 meter long. Fold them in half and thread one end through the top opening of the bottle. Pull tight and tie off securely with a knot or bow.","purpose":"To create handles for hanging the lanterns.","tools":["Rope cutter"],"warnings":[]},{"title":"Final Assembly","action":"Assemble all four bottles into a square formation, connecting them at their bases with rope or additional glue if necessary.","details":"Arrange the bottles in a square and use more hot glue to secure any loose connections. Make sure they are stable and won't fall apart when hung.","purpose":"To create a cohesive structure for hanging.","tools":["Hot glue gun"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"DIY Hanging Lantern","description":"Create a beautiful and eco-friendly hanging lantern using plastic bottles, rope, and LED strip lights.","materials":[{"name":"Plastic bottles","quantity":"4-6"},{"name":"Rope","quantity":"10 meters"},{"name":"LED strip lights","quantity":"2 meters"}],"steps":[{"title":"Prepare the Bottles","action":"Clean and dry the plastic bottles thoroughly.","details":"Remove any labels or stickers from the bottles. Ensure they are completely dry before proceeding.","purpose":"To ensure the bottles are safe to use and free of contaminants.","tools":[],"warnings":["Handle with care as the bottles may be fragile."]},{"title":"Cut the Bottles","action":"Use a utility knife or scissors to cut off the bottom third of each bottle.","details":"Make sure the cuts are even and smooth. This will create a flat surface for attaching the LED strip lights.","purpose":"To provide a stable base for the LED strip lights.","tools":["Utility knife","Scissors"],"warnings":[]},{"title":"Attach the LED Strip Lights","action":"Apply hot glue to the cut edge of each bottle and attach one end of the LED strip light.","details":"Ensure the LED lights are securely attached. You may need to trim any excess wire if necessary.","purpose":"To provide lighting for your lantern.","tools":["Hot glue gun"],"warnings":[]},{"title":"Create Hanging Straps","action":"Cut two pieces of rope, each about 1 meter long.","details":"Fold the ends of the ropes to create a loop for hanging. Secure with a knot or hot glue if needed.","purpose":"To allow you to hang your lantern from a ceiling or hook.","tools":["Scissors"],"warnings":[]},{"title":"Assemble the Lantern","action":"Insert the LED strip lights into the bottles, ensuring they are centered and evenly spaced.","details":"Adjust the position of the bottles if necessary to ensure a balanced look. Secure any loose connections with hot glue.","purpose":"To complete the lantern structure and prepare it for hanging.","tools":["Hot glue gun"],"warnings":[]},{"title":"Hang Your Lantern","action":"Attach one end of each rope to a bottle, making sure they are evenly spaced around the bottles.","details":"Tighten the ropes and adjust as needed. Once satisfied with the spacing, secure the other ends of the ropes together in a knot or with hot glue.","purpose":"To hang your lantern from a ceiling or hook safely.","tools":["Knot tying skills"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
    {"projectName":"Candle Lanterns","description":"Create beautiful and functional candle lanterns using mason jars. These can be used as decorative lighting in your home or garden.","materials":[{"name":"Mason Jars","quantity":"3"},{"name":"Twine","quantity":"enough for 3 lanterns"},{"name":"Tea Lights","quantity":"9"}],"steps":[{"title":"Prepare the Jars","action":"Wash and dry the mason jars.","details":"Ensure they are clean to avoid any residue affecting the tea lights or creating a mess.","purpose":"To ensure the jars are ready for use.","tools":[],"warnings":[]},{"title":"Attach Twine","action":"Cut pieces of twine and tie them around the necks of the mason jars.","details":"Make sure to leave enough length on each piece so you can hang the lanterns easily. You may need to make a few knots for security.","purpose":"To create handles that allow easy hanging of the lanterns.","tools":["Scissors"],"warnings":[]},{"title":"Insert Tea Lights","action":"Place one tea light into each mason jar.","details":"Ensure the tea lights are properly seated and secure. You may need to adjust their position slightly for a better fit.","purpose":"To provide light when lit.","tools":[],"warnings":["Be cautious with open flames; keep away from flammable materials."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+candle+lantern+mason+jars"}
{"projectName":"Jewelry Holder","description":"Transform your mason jars into a stylish jewelry holder. Perfect for storing and displaying necklaces, bracelets, or earrings.","materials":[{"name":"Mason Jars","quantity":"3"},{"name":"Twine","quantity":"enough for 3 holders"}],"steps":[{"title":"Prepare the Jars","action":"Wash and dry the mason jars.","details":"Ensure they are clean to avoid any residue affecting the jewelry or creating a mess.","purpose":"To ensure the jars are ready for use.","tools":[],"warnings":[]},{"title":"Attach Twine","action":"Cut pieces of twine and tie them around the necks of the mason jars.","details":"Make sure to leave enough length on each piece so you can hang the holders easily. You may need to make a few knots for security.","purpose":"To create handles that allow easy hanging of the jewelry holder.","tools":["Scissors"],"warnings":[]},{"title":"Decorate (Optional)","action":"Add decorative elements like beads or paint to the jars if desired.","details":"This step is optional but can add a personal touch. Use non-toxic paints and ensure they are dry before handling jewelry.","purpose":"To personalize your holder and make it more attractive.","tools":["Paint","Beads"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+jewelry+holder+mason+jars"}
{"projectName":"DIY Denim Bracelet","description":"Create a stylish and unique bracelet using old denim jeans. This project is perfect for personalizing your accessories or gifting to friends.","materials":[{"name":"Old denim jeans","quantity":"1 pair"},{"name":"Buttons","quantity":"various sizes"},{"name":"Elastic bands","quantity":"2-3 pieces"}],"steps":[{"title":"Prepare the Denim","action":"Cut off a section of the denim from an old pair of jeans.","details":"Use scissors to cut out a strip about 1 inch wide and long enough to wrap around your wrist with some extra length for tying.","purpose":"This will be the base of your bracelet.","tools":["Scissors"],"warnings":["Be careful when using scissors, especially near fabric edges."]},{"title":"Attach Buttons","action":"Thread a button through the denim strip and secure it with needle and thread.","details":"Poke the needle through the denim from one side to the other, then bring it back up on the opposite side. Tie off securely.","purpose":"Add decorative elements to your bracelet.","tools":["Needle","Thread"],"warnings":["Be cautious when handling needles; they can be sharp."]},{"title":"Attach Elastic Bands","action":"Sew the elastic bands onto both ends of the denim strip.","details":"Fold the denim strip in half lengthwise, with the right sides facing each other. Sew along one edge to create a tube shape. Then sew the elastic bands on either end.","purpose":"Make it adjustable and comfortable to wear.","tools":["Needle","Thread"],"warnings":["Be cautious when handling needles; they can be sharp."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+denim+bracelet+tutorial"}
{"projectName":"Denim Coasters","description":"Transform old denim jeans into stylish and functional coasters. These can protect your furniture from water damage and add a unique touch to any room.","materials":[{"name":"Old denim jeans","quantity":"2-3 pieces"},{"name":"Buttons","quantity":"various sizes"}],"steps":[{"title":"Cut Denim into Squares","action":"Cut the denim fabric into square shapes.","details":"Use scissors to cut out squares that are about 4 inches by 4 inches.","purpose":"These will be the base of your coasters.","tools":["Scissors"],"warnings":["Be careful when using scissors, especially near fabric edges."]},{"title":"Attach Buttons","action":"Sew buttons onto each corner of the denim squares.","details":"Poke the needle through the denim from one side to the other, then bring it back up on the opposite side. Tie off securely.","purpose":"Add decorative elements and make them stackable.","tools":["Needle","Thread"],"warnings":["Be cautious when handling needles; they can be sharp."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+denim+coasters+tutorial"}
{"projectName":"Cake Decorating Kit","description":"Create a simple cake decorating kit using your leftover ingredients and a knife. This project is perfect for beginners who want to explore their creativity in the kitchen without baking an entire cake.","materials":[{"name":"Knife","quantity":"1"},{"name":"Cake Frosting Ingredients (e.g., cream cheese, butter, powdered sugar)","quantity":"as needed"}],"steps":[{"title":"Prepare the Knife","action":"Wash and dry your knife thoroughly.","details":"Ensure the knife is clean to avoid any contamination of ingredients.","purpose":"Safety and hygiene","tools":[],"warnings":["Be cautious when handling a sharp object."]},{"title":"Mix Ingredients for Frosting","action":"Combine your frosting ingredients in a bowl until smooth.","details":"Follow the basic recipe: cream cheese (1/2 cup), softened butter (1/2 cup), powdered sugar (3 cups). Adjust to taste.","purpose":"Create a spreadable frosting for decorating cakes or cupcakes.","tools":["Mixing bowl","Whisk"],"warnings":[]},{"title":"Decorate Your Cake","action":"Use the knife to cut and shape your cake, then spread the frosting on top.","details":"Practice making simple designs or patterns with the knife for a fun and personalized touch.","purpose":"Add decorative elements to your cake without baking it entirely.","tools":["Knife"],"warnings":["Be careful not to cut yourself."]}],"referenceVideo":"https://www.youtube.com/results?search_query=cake+decorating+kits+with+knife+tips"}
{"projectName":"DIY Cake Stand","description":"Repurpose your knife and some cake ingredients to create a simple yet elegant cake stand. This project is perfect for those who want to add a personal touch to their kitchen decor.","materials":[{"name":"Knife","quantity":"1"},{"name":"Cake Frosting Ingredients (e.g., cream cheese, butter, powdered sugar)","quantity":"as needed"}],"steps":[{"title":"Prepare the Knife","action":"Wash and dry your knife thoroughly.","details":"Ensure the knife is clean to avoid any contamination of ingredients.","purpose":"Safety and hygiene","tools":[],"warnings":["Be cautious when handling a sharp object."]},{"title":"Create Cake Stand Base","action":"Use the knife to cut small pieces of cake into shapes that can serve as legs for your stand.","details":"Cut 4-6 small, flat pieces from leftover cake.","purpose":"Provide a stable base for the cake stand.","tools":["Knife"],"warnings":["Be careful not to cut yourself."]},{"title":"Assemble the Cake Stand","action":"Arrange the cake pieces on a plate or tray, ensuring they are evenly spaced and stable.","details":"Adjust the height of each piece if needed for balance.","purpose":"Create a simple yet attractive cake stand.","tools":[],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+cake+stand+with+cake+legs"}
{"projectName":"DIY Cake Decorating Kit","description":"Create your own cake decorating kit using an old bottle and some rope. This project is perfect for beginners who want to explore their creativity in baking without the need for a full-sized cake.","materials":[{"name":"Old bottle","quantity":"1"},{"name":"Rope","quantity":"200cm"}],"steps":[{"title":"Prepare the Bottle","action":"Clean and dry the old bottle thoroughly.","details":"Wash the bottle with soap and water, then let it air dry completely before proceeding.","purpose":"Ensure the bottle is clean for safe handling and use.","tools":[],"warnings":[]},{"title":"Cut the Rope","action":"Cut the rope into 10 equal pieces, each about 20cm long.","details":"Use scissors to carefully cut the rope. Ensure the cuts are even for a neat appearance.","purpose":"The rope will be used as handles or decorations on your cake stand.","tools":["scissors"],"warnings":["Be careful when using scissors, especially around small pieces."]},{"title":"Attach the Rope","action":"Wrap each piece of rope around the bottle and tie a knot to secure it in place.","details":"Start by wrapping one end of the rope tightly around the bottle. Then, make several loops before tying a knot at the base of the loops. Repeat this process for all 10 pieces of rope.","purpose":"This will create handles or decorative elements on your cake stand.","tools":[],"warnings":["Be gentle to avoid damaging the bottle."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+cake+decorating+kits"}
