

{"projectName":"Cardboard Birdhouse","description":"Create a simple birdhouse using cardboard to provide shelter for small birds in your garden or backyard.","materials":[{"name":"Corrugated cardboard","quantity":"1 large sheet"},{"name":"Scissors","quantity":"N/A"},{"name":"Glue stick","quantity":"1"},{"name":"Paints and brushes","quantity":"Set of basic colors"},{"name":"Pencil","quantity":"1"}],"steps":[{"title":"Cut the Cardboard","action":"Measure and cut out pieces for the birdhouse.","details":"Cut a rectangular piece (base), two smaller rectangles (sides), one rectangle slightly larger than the base (roof), and four small squares (entrance holes).","purpose":"To form the basic structure of the birdhouse.","tools":["Scissors"],"warnings":["Be careful when using scissors, especially if working with young children."]},{"title":"Assemble the Birdhouse","action":"Glue the pieces together to form a box shape.","details":"Apply glue along the edges of the sides and attach them to the base. Fold and secure the roof piece over the top, gluing it in place.","purpose":"To create the main body of the birdhouse.","tools":["Glue stick"],"warnings":[]},{"title":"Create Entrance Holes","action":"Cut small circular holes on the sides of the birdhouse.","details":"Use a hole punch or a round object to make several entrance holes, ensuring they are not too large for predators but still accessible for birds.","purpose":"To provide entry points for birds.","tools":["Hole punch"],"warnings":[]},{"title":"Add Finishing Touches","action":"Paint the birdhouse and add any decorative elements.","details":"Apply a coat of paint to the exterior, allowing it to dry completely. You can also add small decorations or patterns using additional paints.","purpose":"To make the birdhouse visually appealing and weather-resistant.","tools":["Paints and brushes"],"warnings":[]},{"title":"Attach a Hanger","action":"Cut a piece of string and attach it to the top of the roof for hanging.","details":"Fold a small loop in one end of the string, thread it through a hole cut at the top center of the roof, then tie a knot to secure it tightly.","purpose":"To allow easy placement of the birdhouse in your garden or backyard.","tools":["Scissors"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"DIY Chalkboard Wall Art","description":"Transform scrap pallet wood into unique wall art using chalkboard paint. This project is perfect for adding a rustic touch to your home or office.","materials":[{"name":"Scrap pallet wood","quantity":"1-2 pieces"},{"name":"Nails","quantity":"Approx. 50"},{"name":"Chalkboard paint","quantity":"1 can"}],"steps":[{"title":"Prepare the Pallet Wood","action":"Clean and sand the pallet wood to remove any splinters or rough edges.","details":"Use a fine-grit sandpaper to smooth out the surface of the wood. Wipe away any dust with a damp cloth.","purpose":"Ensure the wood is clean and ready for painting.","tools":["Fine-grit sandpaper","Damp cloth"],"warnings":["Wear gloves when handling nails."]},{"title":"Attach Nails","action":"Hammer nails into the back of the pallet wood to create a hanging mechanism.","details":"Space the nails evenly along the top edge of the wood. Hammer them in until they are flush with the surface.","purpose":"Provide a secure way to hang your chalkboard art.","tools":["Hammer"],"warnings":[]},{"title":"Paint the Pallet Wood","action":"Apply chalkboard paint to one side of the pallet wood using a brush or roller.","details":"Follow the instructions on the paint can for best results. Apply at least two coats, allowing each coat to dry completely before applying the next.","purpose":"Transform the wood into a functional chalkboard surface.","tools":["Brush or roller","Paint tray"],"warnings":[]},{"title":"Allow Drying Time","action":"Let the painted side of the pallet wood dry completely before handling it.","details":"Follow the drying time recommended on the chalkboard paint can. This may take several hours or overnight.","purpose":"Ensure the paint is fully cured and safe to use.","tools":[],"warnings":[]},{"title":"Hang Your Chalkboard Art","action":"Attach a string or wire to the nails on the back of the pallet wood, then hang it on your wall.","details":"Use a nail or hook that can support the weight of the pallet wood. Adjust the position as needed for aesthetic purposes.","purpose":"Display your new chalkboard art in your home or office.","tools":["String or wire","Nail or hook"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"Cardboard Birdhouse","description":"Create a simple birdhouse using cardboard and basic crafting tools. This project is perfect for beginners and can be customized with paint or markers.","materials":[{"name":"Corrugated Cardboard","quantity":"1 sheet"},{"name":"Scissors","quantity":"N/A"},{"name":"Craft Knife","quantity":"N/A"},{"name":"Ruler","quantity":"N/A"},{"name":"Pencil","quantity":"N/A"},{"name":"Paints or Markers (optional)","quantity":"N/A"}],"steps":[{"title":"Measure and Cut","action":"Using a ruler, measure and mark the dimensions for the birdhouse. Typically, you'll need four sides, a bottom, and an entrance hole.","details":"Cut out the pieces using scissors or a craft knife.","purpose":"To create the basic shape of the birdhouse.","tools":["Scissors","Craft Knife"],"warnings":["Be careful when using sharp tools."]},{"title":"Assemble","action":"Fold and glue the sides together to form a box. Attach the bottom piece with glue or tape.","details":"Ensure all corners are glued securely for stability.","purpose":"To assemble the birdhouse into its final shape.","tools":["Glue Stick","Tape"],"warnings":[]},{"title":"Add Entrance Hole","action":"Cut a small circular hole in one of the sides where you want the entrance to be.","details":"This will serve as the birdhouse's entrance. Make sure it’s not too big for the birds you intend to attract.","purpose":"To provide an entry point for birds.","tools":["Craft Knife"],"warnings":[]},{"title":"Paint or Decorate (Optional)","action":"Use paints or markers to decorate your birdhouse. This step is optional but can make the project more fun and personalized.","details":"Let the paint dry completely before placing it outside.","purpose":"To add a personal touch and protect the cardboard from weathering.","tools":["Paints","Markers"],"warnings":[]},{"title":"Place Outside","action":"Attach a string or hook to the top of the birdhouse for hanging. Place it in a suitable location outside where birds can easily find and use it.","details":"Choose an area that is safe from predators but still accessible to birds.","purpose":"To provide shelter for local wildlife.","tools":["String","Hook"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"DIY Hanging Lantern","description":"Create a unique and eco-friendly hanging lantern using plastic bottles, rope, and LED strip lights.","materials":[{"name":"Plastic bottles","quantity":"4-6"},{"name":"Rope","quantity":"10 meters"},{"name":"LED strip lights","quantity":"2 meters"}],"steps":[{"title":"Prepare the Bottles","action":"Clean and dry the plastic bottles thoroughly.","details":"Remove any labels or stickers from the bottles. Ensure they are completely clean to avoid any residue affecting the glue or paint.","purpose":"To ensure a clean surface for the next steps.","tools":[],"warnings":["Handle with care as the bottles may be fragile."]},{"title":"Cut the Bottles","action":"Cut the plastic bottles in half using a sharp knife or box cutter.","details":"Make sure to cut at the widest part of the bottle, just below the shoulder. This will create two halves that can be used as lanterns.","purpose":"To shape the bottles into usable lantern parts.","tools":["Sharp knife or box cutter"],"warnings":["Be careful when using sharp tools."]},{"title":"Attach LED Strip Lights","action":"Insert one end of the LED strip lights into the bottom half of a bottle.","details":"Use hot glue to secure the LED strip in place. Apply a small amount of glue around the edges where the LED strip will be inserted, and press it firmly into position.","purpose":"To light up the lantern from within.","tools":["Hot glue gun"],"warnings":["Be cautious with heat when using hot glue."]},{"title":"Secure the Bottles","action":"Wrap the rope around the top half of each bottle and tie it tightly to form a handle.","details":"Cut two pieces of rope, about 1 meter long. Fold them in half and thread one end through the top opening of the bottle. Pull tight and tie off securely with a knot or bow.","purpose":"To create handles for hanging the lanterns.","tools":["Rope cutter"],"warnings":[]},{"title":"Final Assembly","action":"Assemble all four bottles into a square formation, connecting them at their bases with rope or additional glue if necessary.","details":"Arrange the bottles in a square and use more hot glue to secure any loose connections. Make sure they are stable and won't fall apart when hung.","purpose":"To create a cohesive structure for hanging.","tools":["Hot glue gun"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"DIY Hanging Lantern","description":"Create a beautiful and eco-friendly hanging lantern using plastic bottles, rope, and LED strip lights.","materials":[{"name":"Plastic bottles","quantity":"4-6"},{"name":"Rope","quantity":"10 meters"},{"name":"LED strip lights","quantity":"2 meters"}],"steps":[{"title":"Prepare the Bottles","action":"Clean and dry the plastic bottles thoroughly.","details":"Remove any labels or stickers from the bottles. Ensure they are completely dry before proceeding.","purpose":"To ensure the bottles are safe to use and free of contaminants.","tools":[],"warnings":["Handle with care as the bottles may be fragile."]},{"title":"Cut the Bottles","action":"Use a utility knife or scissors to cut off the bottom third of each bottle.","details":"Make sure the cuts are even and smooth. This will create a flat surface for attaching the LED strip lights.","purpose":"To provide a stable base for the LED strip lights.","tools":["Utility knife","Scissors"],"warnings":[]},{"title":"Attach the LED Strip Lights","action":"Apply hot glue to the cut edge of each bottle and attach one end of the LED strip light.","details":"Ensure the LED lights are securely attached. You may need to trim any excess wire if necessary.","purpose":"To provide lighting for your lantern.","tools":["Hot glue gun"],"warnings":[]},{"title":"Create Hanging Straps","action":"Cut two pieces of rope, each about 1 meter long.","details":"Fold the ends of the ropes to create a loop for hanging. Secure with a knot or hot glue if needed.","purpose":"To allow you to hang your lantern from a ceiling or hook.","tools":["Scissors"],"warnings":[]},{"title":"Assemble the Lantern","action":"Insert the LED strip lights into the bottles, ensuring they are centered and evenly spaced.","details":"Adjust the position of the bottles if necessary to ensure a balanced look. Secure any loose connections with hot glue.","purpose":"To complete the lantern structure and prepare it for hanging.","tools":["Hot glue gun"],"warnings":[]},{"title":"Hang Your Lantern","action":"Attach one end of each rope to a bottle, making sure they are evenly spaced around the bottles.","details":"Tighten the ropes and adjust as needed. Once satisfied with the spacing, secure the other ends of the ropes together in a knot or with hot glue.","purpose":"To hang your lantern from a ceiling or hook safely.","tools":["Knot tying skills"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/watch?v=example123"}
{"projectName":"Candle Lanterns","description":"Create beautiful and functional candle lanterns using mason jars. These can be used as decorative lighting in your home or garden.","materials":[{"name":"Mason Jars","quantity":"3"},{"name":"Twine","quantity":"enough for 3 lanterns"},{"name":"Tea Lights","quantity":"9"}],"steps":[{"title":"Prepare the Jars","action":"Wash and dry the mason jars.","details":"Ensure they are clean to avoid any residue affecting the tea lights or creating a mess.","purpose":"To ensure the jars are ready for use.","tools":[],"warnings":[]},{"title":"Attach Twine","action":"Cut pieces of twine and tie them around the necks of the mason jars.","details":"Make sure to leave enough length on each piece so you can hang the lanterns easily. You may need to make a few knots for security.","purpose":"To create handles that allow easy hanging of the lanterns.","tools":["Scissors"],"warnings":[]},{"title":"Insert Tea Lights","action":"Place one tea light into each mason jar.","details":"Ensure the tea lights are properly seated and secure. You may need to adjust their position slightly for a better fit.","purpose":"To provide light when lit.","tools":[],"warnings":["Be cautious with open flames; keep away from flammable materials."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+candle+lantern+mason+jars"}
{"projectName":"Jewelry Holder","description":"Transform your mason jars into a stylish jewelry holder. Perfect for storing and displaying necklaces, bracelets, or earrings.","materials":[{"name":"Mason Jars","quantity":"3"},{"name":"Twine","quantity":"enough for 3 holders"}],"steps":[{"title":"Prepare the Jars","action":"Wash and dry the mason jars.","details":"Ensure they are clean to avoid any residue affecting the jewelry or creating a mess.","purpose":"To ensure the jars are ready for use.","tools":[],"warnings":[]},{"title":"Attach Twine","action":"Cut pieces of twine and tie them around the necks of the mason jars.","details":"Make sure to leave enough length on each piece so you can hang the holders easily. You may need to make a few knots for security.","purpose":"To create handles that allow easy hanging of the jewelry holder.","tools":["Scissors"],"warnings":[]},{"title":"Decorate (Optional)","action":"Add decorative elements like beads or paint to the jars if desired.","details":"This step is optional but can add a personal touch. Use non-toxic paints and ensure they are dry before handling jewelry.","purpose":"To personalize your holder and make it more attractive.","tools":["Paint","Beads"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+jewelry+holder+mason+jars"}
{"projectName":"DIY Denim Bracelet","description":"Create a stylish and unique bracelet using old denim jeans. This project is perfect for personalizing your accessories or gifting to friends.","materials":[{"name":"Old denim jeans","quantity":"1 pair"},{"name":"Buttons","quantity":"various sizes"},{"name":"Elastic bands","quantity":"2-3 pieces"}],"steps":[{"title":"Prepare the Denim","action":"Cut off a section of the denim from an old pair of jeans.","details":"Use scissors to cut out a strip about 1 inch wide and long enough to wrap around your wrist with some extra length for tying.","purpose":"This will be the base of your bracelet.","tools":["Scissors"],"warnings":["Be careful when using scissors, especially near fabric edges."]},{"title":"Attach Buttons","action":"Thread a button through the denim strip and secure it with needle and thread.","details":"Poke the needle through the denim from one side to the other, then bring it back up on the opposite side. Tie off securely.","purpose":"Add decorative elements to your bracelet.","tools":["Needle","Thread"],"warnings":["Be cautious when handling needles; they can be sharp."]},{"title":"Attach Elastic Bands","action":"Sew the elastic bands onto both ends of the denim strip.","details":"Fold the denim strip in half lengthwise, with the right sides facing each other. Sew along one edge to create a tube shape. Then sew the elastic bands on either end.","purpose":"Make it adjustable and comfortable to wear.","tools":["Needle","Thread"],"warnings":["Be cautious when handling needles; they can be sharp."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+denim+bracelet+tutorial"}
{"projectName":"Denim Coasters","description":"Transform old denim jeans into stylish and functional coasters. These can protect your furniture from water damage and add a unique touch to any room.","materials":[{"name":"Old denim jeans","quantity":"2-3 pieces"},{"name":"Buttons","quantity":"various sizes"}],"steps":[{"title":"Cut Denim into Squares","action":"Cut the denim fabric into square shapes.","details":"Use scissors to cut out squares that are about 4 inches by 4 inches.","purpose":"These will be the base of your coasters.","tools":["Scissors"],"warnings":["Be careful when using scissors, especially near fabric edges."]},{"title":"Attach Buttons","action":"Sew buttons onto each corner of the denim squares.","details":"Poke the needle through the denim from one side to the other, then bring it back up on the opposite side. Tie off securely.","purpose":"Add decorative elements and make them stackable.","tools":["Needle","Thread"],"warnings":["Be cautious when handling needles; they can be sharp."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+denim+coasters+tutorial"}
{"projectName":"Cake Decorating Kit","description":"Create a simple cake decorating kit using your leftover ingredients and a knife. This project is perfect for beginners who want to explore their creativity in the kitchen without baking an entire cake.","materials":[{"name":"Knife","quantity":"1"},{"name":"Cake Frosting Ingredients (e.g., cream cheese, butter, powdered sugar)","quantity":"as needed"}],"steps":[{"title":"Prepare the Knife","action":"Wash and dry your knife thoroughly.","details":"Ensure the knife is clean to avoid any contamination of ingredients.","purpose":"Safety and hygiene","tools":[],"warnings":["Be cautious when handling a sharp object."]},{"title":"Mix Ingredients for Frosting","action":"Combine your frosting ingredients in a bowl until smooth.","details":"Follow the basic recipe: cream cheese (1/2 cup), softened butter (1/2 cup), powdered sugar (3 cups). Adjust to taste.","purpose":"Create a spreadable frosting for decorating cakes or cupcakes.","tools":["Mixing bowl","Whisk"],"warnings":[]},{"title":"Decorate Your Cake","action":"Use the knife to cut and shape your cake, then spread the frosting on top.","details":"Practice making simple designs or patterns with the knife for a fun and personalized touch.","purpose":"Add decorative elements to your cake without baking it entirely.","tools":["Knife"],"warnings":["Be careful not to cut yourself."]}],"referenceVideo":"https://www.youtube.com/results?search_query=cake+decorating+kits+with+knife+tips"}
{"projectName":"DIY Cake Stand","description":"Repurpose your knife and some cake ingredients to create a simple yet elegant cake stand. This project is perfect for those who want to add a personal touch to their kitchen decor.","materials":[{"name":"Knife","quantity":"1"},{"name":"Cake Frosting Ingredients (e.g., cream cheese, butter, powdered sugar)","quantity":"as needed"}],"steps":[{"title":"Prepare the Knife","action":"Wash and dry your knife thoroughly.","details":"Ensure the knife is clean to avoid any contamination of ingredients.","purpose":"Safety and hygiene","tools":[],"warnings":["Be cautious when handling a sharp object."]},{"title":"Create Cake Stand Base","action":"Use the knife to cut small pieces of cake into shapes that can serve as legs for your stand.","details":"Cut 4-6 small, flat pieces from leftover cake.","purpose":"Provide a stable base for the cake stand.","tools":["Knife"],"warnings":["Be careful not to cut yourself."]},{"title":"Assemble the Cake Stand","action":"Arrange the cake pieces on a plate or tray, ensuring they are evenly spaced and stable.","details":"Adjust the height of each piece if needed for balance.","purpose":"Create a simple yet attractive cake stand.","tools":[],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+cake+stand+with+cake+legs"}
{"projectName":"DIY Cake Decorating Kit","description":"Create your own cake decorating kit using an old bottle and some rope. This project is perfect for beginners who want to explore their creativity in baking without the need for a full-sized cake.","materials":[{"name":"Old bottle","quantity":"1"},{"name":"Rope","quantity":"200cm"}],"steps":[{"title":"Prepare the Bottle","action":"Clean and dry the old bottle thoroughly.","details":"Wash the bottle with soap and water, then let it air dry completely before proceeding.","purpose":"Ensure the bottle is clean for safe handling and use.","tools":[],"warnings":[]},{"title":"Cut the Rope","action":"Cut the rope into 10 equal pieces, each about 20cm long.","details":"Use scissors to carefully cut the rope. Ensure the cuts are even for a neat appearance.","purpose":"The rope will be used as handles or decorations on your cake stand.","tools":["scissors"],"warnings":["Be careful when using scissors, especially around small pieces."]},{"title":"Attach the Rope","action":"Wrap each piece of rope around the bottle and tie a knot to secure it in place.","details":"Start by wrapping one end of the rope tightly around the bottle. Then, make several loops before tying a knot at the base of the loops. Repeat this process for all 10 pieces of rope.","purpose":"This will create handles or decorative elements on your cake stand.","tools":[],"warnings":["Be gentle to avoid damaging the bottle."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+cake+decorating+kits"}
{"projectName":"Jute Wrapped Mason Jar Lanterns","description":"Create beautiful and rustic lanterns to add a warm glow to any room or outdoor setting.","materials":[{"name":"Mason jars","quantity":"3"},{"name":"Twine","quantity":"enough for 3 jars"},{"name":"Tea lights","quantity":"9"}],"steps":[{"title":"Prepare the Jars","action":"Wrap twine around each mason jar.","details":"Start by cutting a length of twine that is about 2-3 times the circumference of your jar. Fold it in half and use a pencil or chopstick to create a loop at the top, securing it with a knot.","purpose":"To add a decorative touch and ensure the tea lights are safely held inside.","tools":["Pencil","Chopstick"],"warnings":["Be careful when handling hot tea lights."]},{"title":"Insert Tea Lights","action":"Place a tea light into each jar.","details":"Gently slide the tea light into the bottom of the jar, making sure it is centered and secure. Use tweezers if needed to avoid burns.","purpose":"To provide illumination inside the jars.","tools":["Tweezers"],"warnings":["Handle with care as the tea lights are hot."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+lantern+mason+jars"}
{"projectName":"Twine and Tea Light Coasters","description":"Make charming coasters to protect your furniture from water damage while adding a cozy touch.","materials":[{"name":"Mason jars","quantity":"3"},{"name":"Twine","quantity":"enough for 6 coasters"},{"name":"Tea lights","quantity":"9"}],"steps":[{"title":"Create Twine Bases","action":"Wrap twine around a jar to form the base of each coaster.","details":"Cut a length of twine and wrap it tightly around the middle of the jar. Secure with knots on both sides, leaving enough excess to fold over and create a flat surface for the coaster.","purpose":"To provide a sturdy base for the tea lights.","tools":["Scissors"],"warnings":["Be careful when cutting twine to avoid cuts."]},{"title":"Attach Tea Lights","action":"Place a tea light on each wrapped jar.","details":"Gently place a tea light in the center of each wrapped base. Ensure it is centered and secure, using tweezers if needed to avoid burns.","purpose":"To provide illumination from underneath the coaster.","tools":["Tweezers"],"warnings":["Handle with care as the tea lights are hot."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+coasters+mason+jars"}
{"projectName":"USB Camera Phone Mount","description":"Create a custom mount to attach your Raspberry Pi camera directly to your smartphone for hands-free photography or videography.","materials":[{"name":"mobile phone cover","quantity":"1"},{"name":"USB cable","quantity":"1"},{"name":"Raspberry Pi camera","quantity":"1"}],"steps":[{"title":"Prepare the Phone Cover","action":"Cut a hole in the mobile phone cover to fit your Raspberry Pi camera.","details":"Use scissors or a craft knife to carefully cut an opening that allows the camera lens to protrude without obstruction.","purpose":"Ensure the camera can be used while mounted on the phone cover.","tools":["scissors","craft knife"],"warnings":["Be careful not to damage the camera lens."]},{"title":"Attach the USB Cable","action":"Secure one end of the USB cable to the mobile phone cover near the cutout for the Raspberry Pi camera.","details":"Use a small piece of tape or hot glue to attach the USB cable to the cover, ensuring it stays in place and doesn't interfere with the camera lens.","purpose":"Provide a secure connection point for the Raspberry Pi camera.","tools":["hot glue gun","tape"],"warnings":["Be cautious when using hot glue to avoid burns."]},{"title":"Mount the Camera","action":"Insert the Raspberry Pi camera through the cutout and connect it to the USB cable attached to the phone cover.","details":"Make sure the camera is properly seated in the cutout and securely connected to the USB cable. Test the connection by powering on your smartphone and checking if the camera works.","purpose":"Ensure the camera is correctly mounted and functional.","tools":["USB cable"],"warnings":["Handle the Raspberry Pi camera carefully to avoid damaging it."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Raspberry+Pi+camera+phone+mount"}
{"projectName":"Phone Stand","description":"Create a simple phone stand using the mobile phone cover to elevate your smartphone for better viewing angles or hands-free use.","materials":[{"name":"mobile phone cover","quantity":"1"}],"steps":[{"title":"Prepare the Phone Cover","action":"Fold the mobile phone cover in half to create a triangular stand.","details":"Hold the cover at one corner and fold it over to form a triangle. Ensure both halves are aligned properly for stability.","purpose":"Create a stable base for the phone.","tools":[],"warnings":["Be careful not to tear the cover while folding."]},{"title":"Attach the Phone","action":"Place your smartphone on top of the folded cover and adjust its position as needed.","details":"Make sure the phone is centered and stable. You can use a small piece of tape or sticky notes to secure it if necessary.","purpose":"Ensure the phone stays in place while using the stand.","tools":["tape","sticky notes"],"warnings":["Be cautious when placing the phone on the cover to avoid damaging the screen."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+phone+stand+mobile+cover"}
{"projectName":"Raspberry Pi Camera Web Server","description":"Create a simple web server that streams live video from the Raspberry Pi Camera and displays it on any device with internet access.","materials":[{"name":"Raspberry Pi","quantity":"1"},{"name":"Raspberry Pi Camera Module","quantity":"1"},{"name":"MicroSD Card","quantity":"1"},{"name":"Power Supply for Raspberry Pi","quantity":"1"},{"name":"Ethernet Cable or Wi-Fi Adapter","quantity":"1"}],"steps":[{"title":"Prepare the Raspberry Pi","action":"Install Raspbian OS on MicroSD card and configure it to boot from SD.","details":"Download Raspbian from official website, use Etcher for flashing. Set up Wi-Fi or Ethernet connection.","purpose":"Ensure your Raspberry Pi is ready to run the software.","tools":[],"warnings":["Backup data before flashing new OS."]},{"title":"Install Required Software","action":"Update and upgrade Raspbian packages, then install motion and nginx.","details":"Open terminal on Raspberry Pi. Run `sudo apt-get update && sudo apt-get upgrade` followed by `sudo apt-get install motion nginx`.","purpose":"Set up the necessary software for video streaming.","tools":["Terminal"],"warnings":[]},{"title":"Configure Motion","action":"Edit motion configuration file to enable camera and set resolution.","details":"Open `/etc/motion/motion.conf` in a text editor. Set `camera_type` to `picamera`, adjust `width` and `height` as needed, and ensure `stream_localhost` is set to `no` for remote access.","purpose":"Configure motion to stream video over the network.","tools":["Text Editor"],"warnings":[]},{"title":"Start Motion Service","action":"Run motion service and check if it starts successfully.","details":"Use `sudo service motion start` in terminal. Check logs with `tail -f /var/log/motion.log` for any errors.","purpose":"Ensure the video stream is active.","tools":["Terminal"],"warnings":[]},{"title":"Configure Nginx","action":"Edit nginx configuration to serve motion streams.","details":"Open `/etc/nginx/sites-available/default` in a text editor. Add `location /cam { include /etc/nginx/motion.conf; }` under server block, then reload nginx with `sudo service nginx reload`.","purpose":"Set up Nginx to stream video from motion.","tools":["Text Editor"],"warnings":[]},{"title":"Test the Web Server","action":"Open a web browser and navigate to your Raspberry Pi’s IP address followed by `/cam`.","details":"Go to `http://<Raspberry_Pi_IP>/cam` in your browser. You should see live video streaming from the camera.","purpose":"Verify that everything is working as expected.","tools":["Web Browser"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=Raspberry+Pi+Camera+Web+Server"}
{"projectName":"DIY Denim Bag","description":"Turn old denim jeans into a stylish reusable bag.","materials":[{"name":"Old denim jeans","quantity":"1 pair"},{"name":"Buttons","quantity":"5-10 pieces"},{"name":"Elastic bands","quantity":"2 pieces, 1 inch wide each"}],"steps":[{"title":"Prepare the Jeans","action":"Cut off the legs of the jeans.","details":"Measure and mark where you want to cut the legs. Cut carefully using scissors or a sewing machine.","purpose":"Create the bag body.","tools":["Scissors","Sewing machine"],"warnings":["Be careful when handling sharp objects."]},{"title":"Stitch the Bottom","action":"Stitch the bottom of the jeans legs together.","details":"Fold the cut edges inward and stitch them to create a flat base for the bag.","purpose":"Provide structural support at the bottom.","tools":["Sewing machine"],"warnings":[]},{"title":"Attach Handles","action":"Attach handles made from elastic bands.","details":"Cut two pieces of elastic to desired length. Sew them onto the top edges of the bag legs, about 2 inches apart.","purpose":"Make it easy to carry the bag.","tools":["Sewing machine"],"warnings":[]},{"title":"Add Decorative Buttons","action":"Attach buttons for decoration and functionality.","details":"Stitch buttons onto the front or back of the bag. You can use them as closure or just for aesthetics.","purpose":"Enhance the look and add a functional element.","tools":["Sewing machine"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Denim+Bags"}
{"projectName":"DIY Wind Chime","description":"Create a unique wind chime using a plastic cup and metal generator parts.","materials":[{"name":"Plastic Cup","quantity":"1"},{"name":"Metal Generator Parts (screws, washers)","quantity":"Various"},{"name":"String or Twine","quantity":"20cm"},{"name":"Paint or Markers","quantity":"Optional"}],"steps":[{"title":"Prepare the Cup","action":"Clean and dry the plastic cup.","details":"","purpose":"Ensure it's ready for painting or decorating.","tools":[],"warnings":[]},{"title":"Decorate the Cup (Optional)","action":"Paint or decorate the cup with markers if desired.","details":"Let dry completely before proceeding.","purpose":"Add a personal touch to your wind chime.","tools":["Paint","Markers"],"warnings":[]},{"title":"Attach Metal Parts","action":"Drill small holes in the cup and attach metal parts with string or twine.","details":"Ensure all parts are securely attached to prevent falling off.","purpose":"Create the chime mechanism.","tools":["Drill","String or Twine"],"warnings":["Use caution when drilling."]},{"title":"Hang Your Wind Chime","action":"Attach a longer piece of string to the top of the cup and hang it in a suitable location.","details":"","purpose":"Enjoy your new wind chime!","tools":["String or Twine"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Wind+Chime"}
{"projectName":"DIY Wind Chime","description":"Create a unique wind chime using a plastic cup and a metal generator as the base.","materials":[{"name":"Plastic cup","quantity":"1"},{"name":"Metal generator parts (screws, nuts)","quantity":"varies"},{"name":"Nails or hooks","quantity":"4"},{"name":"String or wire","quantity":"20cm"},{"name":"Decorative beads","quantity":"10"}],"steps":[{"title":"Prepare the Base","action":"Disassemble the metal generator to use its parts as a base.","details":"Remove any non-metallic components and clean the metal pieces.","purpose":"To create a sturdy base for your wind chime.","tools":["Screwdriver","Pliers"],"warnings":["Be careful when handling sharp or rusty metal."]},{"title":"Attach the Cup","action":"Secure the plastic cup to the top of the metal generator.","details":"Use screws and nuts to attach the cup, ensuring it is stable and won't fall off easily.","purpose":"To create a focal point for your wind chime.","tools":["Screwdriver","Pliers"],"warnings":[]},{"title":"Add Decorative Beads","action":"String the decorative beads onto the wire or string.","details":"Thread the beads in a pattern that you like, ensuring they are evenly spaced.","purpose":"To add color and texture to your wind chime.","tools":["Needle-nose pliers"],"warnings":[]},{"title":"Attach the Beads","action":"Secure the string of beads to the metal generator base.","details":"Use additional screws or wire to attach the string of beads to the metal parts, ensuring they are secure and won't fall off easily.","purpose":"To complete your wind chime design.","tools":["Screwdriver","Wire cutters"],"warnings":[]},{"title":"Hang Your Wind Chime","action":"Find a suitable location to hang your wind chime.","details":"Choose an outdoor area that is sheltered from direct sunlight and rain, but still exposed to the wind.","purpose":"To enjoy the sound of your creation in the breeze.","tools":["Nails or hooks"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Wind+Chime"}
{"projectName":"DIY Photo Frame","description":"Create a simple and stylish photo frame using a plastic sheet.","materials":[{"name":"Plastic sheet","quantity":"1 large sheet"},{"name":"Uncovered copy","quantity":"4 pieces"},{"name":"Stapler","quantity":"1"},{"name":"Scissors","quantity":"1 pair"}],"steps":[{"title":"Cut the Plastic Sheet","action":"Measure and cut a piece of plastic sheet to fit your photo.","details":"Use scissors to carefully cut the plastic sheet. Ensure it is slightly larger than the photo for a neat finish.","purpose":"To create a protective cover for the photo.","tools":["Scissors"],"warnings":["Be careful when using scissors."]},{"title":"Prepare the Copies","action":"Cut four pieces of uncovered copy to fit around the plastic sheet.","details":"Use scissors to cut the paper into strips that will form the frame. Ensure they are long enough to wrap around the edges of the plastic sheet.","purpose":"To create a physical frame for the photo.","tools":["Scissors"],"warnings":[]},{"title":"Attach the Copies","action":"Staple the copies onto the plastic sheet, forming a frame around it.","details":"Place the cut pieces of paper along the edges of the plastic sheet. Staple them in place using the stapler, making sure they are secure and evenly spaced.","purpose":"To create a sturdy and attractive photo frame.","tools":["Stapler"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Photo+Frame+Plastic+Sheet"}
{"projectName":"DIY Plant Pot Liner","description":"Create reusable plant pot liners to protect your pots and trays from soil spillage.","materials":[{"name":"Plastic sheet","quantity":"1 large sheet"},{"name":"Stapler","quantity":"1"},{"name":"Scissors","quantity":"1 pair"}],"steps":[{"title":"Cut the Plastic Sheet","action":"Measure and cut a piece of plastic sheet to fit your plant pot.","details":"Ensure there is enough extra material around the edges for stapling.","purpose":"Prepare the base material for use as a liner.","tools":["Scissors"],"warnings":["Be careful when cutting, avoid sharp edges."]},{"title":"Attach to Pot","action":"Staple the plastic sheet around the rim of the plant pot.","details":"Start from one side and work your way around, ensuring a tight seal.","purpose":"Secure the liner in place to prevent soil leakage.","tools":["Stapler"],"warnings":["Handle staples carefully to avoid injury."]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Plant+Pot+Liner"}
{"projectName":"DIY Plant Stand","description":"Create a unique and rustic plant stand using scrap pallet wood.","materials":[{"name":"Pallet wood","quantity":"1"},{"name":"Nails","quantity":"50 pieces"},{"name":"Chalk paint","quantity":"1 can"}],"steps":[{"title":"Gather Materials","action":"Collect all the materials needed for the project.","details":"","purpose":"Ensure you have everything before starting.","tools":[],"warnings":[]},{"title":"Prepare Pallet Wood","action":"Cut pallet wood into desired lengths and shapes using a saw.","details":"Measure and mark the wood first to ensure accurate cuts.","purpose":"Create the structural components of the plant stand.","tools":["Saw"],"warnings":["Wear safety goggles when cutting wood."]},{"title":"Assemble Plant Stand","action":"Nail the pieces together to form a rectangular or square frame.","details":"Arrange the pieces in a way that provides stability and balance.","purpose":"Construct the basic structure of the plant stand.","tools":["Hammer"],"warnings":[]},{"title":"Paint with Chalk Paint","action":"Apply chalk paint to the assembled plant stand using a brush.","details":"Follow the instructions on the chalk paint can for best results.","purpose":"Add a decorative finish and protect the wood from weathering.","tools":["Brush"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Plant+Stand+pallet+wood"}
{"projectName":"DIY Plant Stand","description":"Create a unique and rustic plant stand using scrap pallet wood, nails, and chalk paint.","materials":[{"name":"Pallet wood","quantity":"1"},{"name":"Nails","quantity":"20"},{"name":"Chalk paint","quantity":"1 can"}],"steps":[{"title":"Prepare the Pallet Wood","action":"Remove any nails or screws from the pallet wood using a hammer and claw.","details":"Ensure all nails are removed to prevent injury during assembly.","purpose":"Prevent damage to your tools and ensure safety when working with the wood.","tools":["Hammer","Claw"],"warnings":["Wear gloves to protect hands from splinters."]},{"title":"Cut the Wood","action":"Measure and cut four pieces of pallet wood into equal lengths for the legs of the stand.","details":"Use a saw to make clean cuts. Measure twice, cut once.","purpose":"Ensure all pieces are uniform in size for stability.","tools":["Saw"],"warnings":[]},{"title":"Assemble the Legs","action":"Arrange the four legs into a square or rectangle and secure them with nails at each corner.","details":"Hammer nails through the top piece of wood into the bottom pieces to form a sturdy base.","purpose":"Create a stable structure for the plant stand.","tools":["Hammer","Nails"],"warnings":[]},{"title":"Paint the Plant Stand","action":"Apply chalk paint to the assembled plant stand using a brush or roller.","details":"Follow the instructions on the chalk paint can for best results. Allow it to dry completely before use.","purpose":"Add a personalized touch and protect the wood from moisture.","tools":["Brush","Roller"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+Plant+Stand+pallet+wood"}
{"projectName":"DIY String Light Chandelier","description":"Create a unique and eco-friendly string light chandelier using plastic bottles, rope, and LED strip lights.","materials":[{"name":"Plastic bottles","quantity":"10"},{"name":"Rope","quantity":"5 meters"},{"name":"LED strip lights","quantity":"1 meter"}],"steps":[{"title":"Prepare the Bottles","action":"Cut off the bottom of each plastic bottle and clean them thoroughly.","details":"","purpose":"To create a stable base for hanging the bottles.","tools":["Scissors","Ruler"],"warnings":["Be careful when using scissors."]},{"title":"Attach LED Strip Lights","action":"Cut the LED strip lights into 10 equal pieces and attach them to the inside of each bottle.","details":"","purpose":"To light up the bottles from within.","tools":["Wire cutter","Screwdriver"],"warnings":[]},{"title":"String the Bottles","action":"Thread the rope through the necks of each bottle, spacing them evenly along the length of the rope.","details":"","purpose":"To hang the bottles in a line.","tools":["Needle and thread (optional)"],"warnings":[]},{"title":"Final Assembly","action":"Secure the LED strip lights inside each bottle, ensuring they are properly connected to the power source.","details":"","purpose":"To ensure all bottles light up evenly.","tools":["Screwdriver"],"warnings":[]}],"referenceVideo":"https://www.youtube.com/results?search_query=DIY+String+Light+Chandelier"}